// Метод flatMap(callback) - аналогічний методу map(), але застосовується
// у випадках, коли результат - це багатовимірний масив, який необхідно
// «розгладити».

// массив.flatMap((element, index, array) => {
//     // Тіло колбек-функції
//   });

// У масиві students зберігається список студентів зі списком предметів,
// які відвідує студент, у властивості courses.
// Кілька студентів можуть відвідувати один і той самий предмет.
// Необхідно скласти список всіх предметів, які відвідує ця група студентів,
// поки що, навіть повторюваних.

const students = [
    { name: "Манго", courses: ["математика", "фізика"] },
    { name: "Полі", courses: ["інформатика", "математика"] },
    { name: "Ківі", courses: ["фізика", "біологія"] },
];

// const course = students.map(student => student.courses)
// console.log(course)

// console.log(students.flatMap(student => student.courses))

